/*----------------------------------------------------------------------------------
* about:页面对象
* author:马兆铿
* date:
* ----------------------------------------------------------------------------------*/
/* ----------------------------------------- 开始运行 ----------------------------------------- */
import React from 'react'
import '../../style/pages/Scroller.less'
import Screen from './components/Screen'

//
class Scroller extends React.Component {
  constructor (props) {
    super(props)
    this.state = {}
  }

  /* ----------------------------------------- 生命周期 ----------------------------------------- */
  componentDidMount () {
  }

  /* ----------------------------------------- 自定义方法 ----------------------------------------- */


  /* ----------------------------------------- 绑定方法 ----------------------------------------- */

  /* ----------------------------------------- 渲染 ----------------------------------------- */
  render () {
    return (
      <div className="page">
        <header>无限滚动</header>
        <Screen
          itemHeight={40}
        />
      </div>
    )
  }
}

export default Scroller
