<!----------------------------------------------------------------------------------
about：组件例子
author：马兆铿
date：2019-08-01
----------------------------------------------------------------------------------->

<template>
  <div class="foo">

  </div>
</template>

<script>

  export default {
    name: 'Foo',
    components: {},
    data () {
      return {}
    },
    created () {
    },
    methods: {
      /* ----------------------------------------- 绑定方法 ----------------------------------------- */

      /* ----------------------------------------- 自定义方法 ----------------------------------------- */

    }
  }
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style lang="less" scoped>
  .foo {
  }
</style>
